export const cities = [
    
    'Αθήνα',
    'Θεσσαλονίκη',
    'Πάτρα',
    'Ηράκλειο',
    'Λάρισα',
    'Βόλος',
    'Ιωάννινα',
    'Τρίκαλα',
    'Χαλκίδα',
    'Σέρρες',
    'Αλεξανδρούπολη',
    'Ξάνθη',
    'Κατερίνη',
    'Αγρίνιο', 
    'Καλαμάτα',
    'Καβάλα',
    'Καρδίτσα',
    'Λαμία',
    'Ραφήνα',
   
    
]

export const all_categories = [
    'strings',
    'woodwind',
    'keys',
    'vocals',
    // 'other',
    'percussion'
]

export const keys = [
    'Πιάνο',
    'Αρμόνιο'
]

export const strings = [
    'Κιθάρα',
    'Μπάσο',
    'Μπουζούκι',
    'Ηλεκτρική κιθάρα',
    'Ακουστική κιθάρα',
    'Άρπα',
    'Τσέλο',
    'Βιολί',
    'Λαούτο'
]
export const woodwind = [
    'Τρομπέτα',
    'Φλάουτο',
    'Κλαρινέτο',
    'Όμποε',
    'Σαξόφωνο',
    'Τούμπα',
    'Κορνέτο',
]
export const percussion = [
    'Ντραμς',
    'Καχόν',
    'Ξυλόφωνο',
    'Τρίγωνο',
    'Κλακέτες',
    'Κόνγκ',

]
export const vocals = [
    'Φωνητικά',
    'Δεύτερες',
    'Άλτο',
    'Σοπράνο',

]

export const genres = [
    'Rock',
    'Metal',
    'Punk',
    'Rock & Roll',
    'Country',
    'Jazz',
    'Pop',
]